cf/DataProcessors/ГрупповоеПерепроведениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеПерепроведениеДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОстанавливатьсяПоОшибке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/ДатаАктуальностиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДатаАктуальностиУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОценкаМПЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетыСКонтрагентами</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НУ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ВидыСостоянийРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийРегламентныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненоСошибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/СчетФактураВыданный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СчетФактураВыданный</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеНаРасчетныйСчет</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.КорректировкаДолга</xr:Item>
				<xr:Item>Document.ОтчетКомиссионераОПродажах</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ПередачаНМА</xr:Item>
				<xr:Item>Document.ПередачаОС</xr:Item>
				<xr:Item>Document.ДокументРасчетовСКонтрагентом</xr:Item>
				<xr:Item>Document.АктОбОказанииПроизводственныхУслуг</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
				<xr:Item>Document.ОтчетКомитентуОПродажах</xr:Item>
				<xr:Item>Document.РеализацияУслугПоПереработке</xr:Item>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.ОтражениеНачисленияНДС</xr:Item>
				<xr:Item>Document.РеализацияОтгруженныхТоваров</xr:Item>
				<xr:Item>Document.НачислениеНДСпоСМРхозспособом</xr:Item>
				<xr:Item>Document.СписаниеСРасчетногоСчета</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСсАвансов</xr:Item>
				<xr:Item>AccumulationRegister.НДСНачисленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДСВидСчетаФактуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоРасчетыВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоРасчетыИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Под0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма по документу основанию в валюте документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированПриВводеНачальныхОстатковНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.АвизоРасчетыВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
								<v8:Type>cfg:DocumentRef.АвизоРасчетыИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДатаНомерДокументовОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежноРасчетногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежноРасчетногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Авансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьСчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/DataProcessors/ГрупповоеПерепроведениеДокументов/Ext/ObjectModule.bsl
Перем мНаборыШаблон;

Перем мКэшОбработки;

Функция СформироватьСписокДатОкончанияПроведения(ДатаНач) Экспорт

	ДатаРассчитанныхИтогов = Дата('39990101');
	Для Каждого Регистр Из РегистрыНакопления Цикл
		МетаданныеРегистра = Метаданные.НайтиПоТипу(Тип(Регистр));
		Если МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда		
			ПериодИтоговРегистра = Регистр.ПолучитьПериодРассчитанныхИтогов();		
			Если ПериодИтоговРегистра < ДатаРассчитанныхИтогов Тогда
				ДатаРассчитанныхИтогов = ПериодИтоговРегистра;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СписокВыбора = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ДатаНач) И КонецМесяца(ДатаНач) <= ДатаРассчитанныхИтогов Тогда
		
		ДатаКонцаПериода = КонецМесяца(ДатаНач);
		Пока ДатаКонцаПериода <= ДатаРассчитанныхИтогов Цикл
			СписокВыбора.Добавить(ДатаКонцаПериода, Формат(ДатаКонцаПериода, "ДФ=dd.MM.yyyy"));
			ДатаКонцаПериода = КонецМесяца(ДатаКонцаПериода + 1);
		КонецЦикла;		
		
	КонецЕсли;
	
	СписокВыбора.Добавить(Дата('00010101'), "без ограничений");
	
	Возврат СписокВыбора;

КонецФункции

Процедура ПровестиРегламентныеДокументыЗаМесяц(РегДокументы,Дата,ФормаПрогрессора,ВозниклаОшибка = ложь)
	
	Для каждого СтрокаДокумента из РегДокументы Цикл
		Если Не СтрокаДокумента.Выполнена И НачалоМесяца(СтрокаДокумента.Дата) <= Дата Тогда
			
			Если ФормаПрогрессора <> Неопределено Тогда
				ФормаПрогрессора.КомментарийЗначения = СтрокаДокумента.Представление;
				ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
			КонецЕсли;
			
			ДокументОбъект = СтрокаДокумента.Ссылка.ПолучитьОбъект();

			ДокументОбъект.ВыполнитьОперацию();
			Если ДокументОбъект.Ошибки.Количество() > 0  Тогда
				Если ОстанавливатьсяПоОшибке Тогда
					ВозниклаОшибка = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаДокумента.Выполнена = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиРегламентныеДокументыЗаМесяцПоНДС(ВсеДокументы,Дата,ФормаПрогрессора,СдвигатьГраницуАктуальности,ЗаписыватьОшибкиВЖурналРегистрации,ИндексСтрокиНачалаДаты,ВозниклаОшибка=ложь)
	
	Для каждого СтрокаДокумента из ВсеДокументы Цикл
		Если СтрокаДокумента.РеглДокумент И Не СтрокаДокумента.Выполнена И НачалоМесяца(СтрокаДокумента.Дата) <= Дата Тогда
			
			Если ФормаПрогрессора <> Неопределено Тогда
				ФормаПрогрессора.КомментарийЗначения = СтрокаДокумента.Представление;
				ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
			КонецЕсли;
			
			ДокументОбъект = СтрокаДокумента.Ссылка.ПолучитьОбъект();
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Если СдвигатьГраницуАктуальности Тогда
									
					Если СтрокаДокумента.БылаОшибка Тогда
						// для документа уже была ошибка проведения, продолжение не возможно
						ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(), , "Ошибка проведения!");
						Если ОстанавливатьсяПоОшибке Тогда
							ВозниклаОшибка = Истина;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					
					СдвигГраницыАктуальностиПоРазделам(СтрокаДокумента.ИмяДокумента, ДокументОбъект, ЗаписыватьОшибкиВЖурналРегистрации);
					СтрокаДокумента.БылаОшибка = Истина;
					индекс = ИндексСтрокиНачалаДаты;
					
				Иначе
					
					ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(), , "Ошибка проведения!");
					Если ОстанавливатьсяПоОшибке Тогда
						Прервать;
					КонецЕсли;				
				КонецЕсли;
			КонецПопытки;
			
			СтрокаДокумента.Выполнена = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаДокумента из ВсеДокументы Цикл
		Если СтрокаДокумента.СвязанныйДокумент И Не СтрокаДокумента.Выполнена И НачалоМесяца(СтрокаДокумента.Дата) <= Дата Тогда
			
			Если ФормаПрогрессора <> Неопределено Тогда
				ФормаПрогрессора.КомментарийЗначения = СтрокаДокумента.Представление;
				ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
			КонецЕсли;
			
			ДокументОбъект = СтрокаДокумента.Ссылка.ПолучитьОбъект();
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Если СдвигатьГраницуАктуальности Тогда
									
					Если СтрокаДокумента.БылаОшибка Тогда
						// для документа уже была ошибка проведения, продолжение не возможно
						ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(), , "Ошибка проведения!");
						Если ОстанавливатьсяПоОшибке Тогда
							ВозниклаОшибка = Истина;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					
					СдвигГраницыАктуальностиПоРазделам(СтрокаДокумента.ИмяДокумента, ДокументОбъект, ЗаписыватьОшибкиВЖурналРегистрации);
					СтрокаДокумента.БылаОшибка = Истина;
					индекс = ИндексСтрокиНачалаДаты;
					
				Иначе
					
					ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(), , "Ошибка проведения!");
					Если ОстанавливатьсяПоОшибке Тогда
						Прервать;
					КонецЕсли;				
				КонецЕсли;
			КонецПопытки;
			
			СтрокаДокумента.Выполнена = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура перепроведения документов
//
// Параметры: 
//  ДатаНач - дата, начиная с которой перепроводятся документы
//  ДатаКон - дата, по которою перепроводятся документы
//  Организация - организация, по которой перепроводятся документы
//  СдвигатьГраницуАктуальности - флаг сдвига назад даты актуальности по разделам учета при ошибке проведения документа
//
	Процедура ПерепроведениеДокументов(ДатаНач, ДатаКон = '00010101', Организация = Неопределено, СдвигатьГраницуАктуальности = Ложь, ЗаписыватьОшибкиВЖурналРегистрации = Ложь) Экспорт
	
	Перем ФормаПрогрессора;
	
	мНаборыШаблон = Новый Структура;
	
	#Если Клиент Тогда
		ФормаПрогрессора = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
		ФормаПрогрессора.НаименованиеОбработкиДанных = "Групповое перепроведение документов";
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Для Каждого ДокументМетаданные ИЗ Метаданные.Документы Цикл
		
		// У некоторых ролей нет прав на отдельные документы
		Если НЕ РольДоступна("ПолныеПрава") Тогда 
			Если НЕ ПравоДоступа("Чтение", ДокументМетаданные) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ИмяДокумента = ДокументМетаданные.Имя;
		//Отсекаем документы, которые не следует перепроводить		
		Если ИмяДокумента = "ВыгрузкаРегламентированныхОтчетов" Тогда
			Продолжить;
		КонецЕсли;
			
		Запрос.Текст = Запрос.Текст + ?(Запрос.Текст = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ") + " 
		|""" + ИмяДокумента + """ КАК ИмяДокумента, 
		|Представление КАК Представление, 
		|Ссылка КАК Ссылка, 
		|Дата КАК Дата,
		|" + ?(ДокументМетаданные.Реквизиты.Найти("РучнаяКорректировка") <> Неопределено, "РучнаяКорректировка", "Ложь") + " КАК РучнаяКорректировка
		|ИЗ Документ." + ИмяДокумента + "
		|ГДЕ Проведен И Дата >= &ДатаНач";
		
		Если ДатаКон <> Дата('00010101') Тогда
			Запрос.Текст = Запрос.Текст + " И Дата <= &ДатаКон";
		КонецЕсли;
		
		Если Организация <> Неопределено И ДокументМетаданные.Реквизиты.Найти("Организация") <> Неопределено Тогда
			Если ТипЗнч(Организация) = Тип("Массив") Тогда
				Запрос.Текст = Запрос.Текст + " И Организация В (&Организация)";
			Иначе
				Запрос.Текст = Запрос.Текст + " И Организация = &Организация";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО Дата, Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	ТаблицаДокументов.Колонки.Добавить("БылаОшибка", Новый ОписаниеТипов("Булево"));
	ВсегоДокументов = ТаблицаДокументов.Количество();
	
	// Регламентные документы по НДС при групповом проведении делаем непроведенными.
	
	ТаблицаДокументов.Колонки.Добавить("РеглДокумент", Новый ОписаниеТипов("Булево"));
	ТаблицаДокументов.Колонки.Добавить("СвязанныйДокумент", Новый ОписаниеТипов("Булево"));
	ТаблицаДокументов.Колонки.Добавить("Выполнена", Новый ОписаниеТипов("Булево"));
	
	ЗапросПоРеглДокументам = Новый Запрос;
	ЗапросПоРеглДокументам.УстановитьПараметр("Организация", Организация);
	ЗапросПоРеглДокументам.УстановитьПараметр("ДатаНач",     ДатаНач);
	ЗапросПоРеглДокументам.УстановитьПараметр("ДатаКон",     КонецДня(ДатаКон));
	
	ТекстЗапросаПоРеглДокументам =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Журнал.Ссылка КАК РеглДокумент
	|ИЗ
	|	ЖурналДокументов.РегламентныеДокументыНДС КАК Журнал
	|ГДЕ
	|	Журнал.Проведен
	|	И Журнал.Дата >= &ДатаНач";
	
	Если Организация <> Неопределено Тогда
		Если ТипЗнч(Организация) = Тип("Массив") Тогда
			ТекстЗапросаПоРеглДокументам = СтрЗаменить(ТекстЗапросаПоРеглДокументам, "Журнал.Проведен", "Журнал.Проведен И Журнал.Организация В (&Организация)");
		Иначе
			ТекстЗапросаПоРеглДокументам = СтрЗаменить(ТекстЗапросаПоРеглДокументам, "Журнал.Проведен", "Журнал.Проведен И Журнал.Организация = (&Организация)");
		КонецЕсли;
	КонецЕсли;
	
	Если ДатаКон <> Дата('00010101') Тогда
		ТекстЗапросаПоРеглДокументам = СтрЗаменить(ТекстЗапросаПоРеглДокументам, "Журнал.Дата >= &ДатаНач", "Журнал.Дата МЕЖДУ &ДатаНач И &ДатаКон");
	КонецЕсли;
	
	ЗапросПоРеглДокументам.Текст = ТекстЗапросаПоРеглДокументам;
	МассивРеглДокументов = ЗапросПоРеглДокументам.Выполнить().Выгрузить().ВыгрузитьКолонку("РеглДокумент");
	
	ЗапросаПоСвязаннымРеглДокументам = Новый Запрос;
	ЗапросаПоСвязаннымРеглДокументам.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК РеглДокумент
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование В(&ДокументыОснования)";
	
	ЗапросаПоСвязаннымРеглДокументам.УстановитьПараметр("ДокументыОснования",     МассивРеглДокументов);
	МассивСвязанныхДокументов = ЗапросаПоСвязаннымРеглДокументам.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетФактура");	
	
	Если ФормаПрогрессора <> Неопределено Тогда
		ФормаПрогрессора.Значение = 0;
		ФормаПрогрессора.МаксимальноеЗначение = ВсегоДокументов;		
		ФормаПрогрессора.КомментарийОбработкиДанных  = "Отмена проведения регламентных документов по НДС";		
		ФормаПрогрессора.Открыть();
	КонецЕсли;	
	
	Для Каждого СтрокаДокумента ИЗ ТаблицаДокументов Цикл
		
		Если ФормаПрогрессора <> Неопределено Тогда
			ФормаПрогрессора.КомментарийЗначения = СтрокаДокумента.Представление;
			ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
		КонецЕсли;
		
		Регистратор = СтрокаДокумента.Ссылка;
		СтрокаДокумента.РеглДокумент = МассивРеглДокументов.Найти(Регистратор) <> Неопределено;
		СтрокаДокумента.СвязанныйДокумент = МассивСвязанныхДокументов.Найти(Регистратор) <> Неопределено;
		
		НачатьТранзакцию();
		
		Если СтрокаДокумента.РучнаяКорректировка Тогда
			ОбщегоНазначения.УдалитьДвиженияРегистратора(СтрокаДокумента.Ссылка.ПолучитьОбъект(), Ложь, Истина);
		ИначеЕсли СтрокаДокумента.РеглДокумент Тогда
			СтрокаДокумента.Ссылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;	
	
	// Документы "Регламентная операция" при групповом проведении делаем неактуальными(отменяем проведение).
	
	ЗапросПоРеглОперациям = Новый Запрос;
	ЗапросПоРеглОперациям.УстановитьПараметр("Организация", Организация);
	ЗапросПоРеглОперациям.УстановитьПараметр("ДатаНач",     ДатаНач);
	ЗапросПоРеглОперациям.УстановитьПараметр("ДатаКон",     КонецМесяца(ДатаКон));
	ПорядокРегламентныхОпераций = новый ТаблицаЗначений;
	ПорядокРегламентныхОпераций.Колонки.Добавить("Порядок",Новый ОписаниеТипов("Число"));
	ПорядокРегламентныхОпераций.Колонки.Добавить("ВидОперации",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыРегламентныхОпераций"));
	Порядок = 1;
	Для каждого ВидРегОперации из Перечисления.ВидыРегламентныхОпераций Цикл
		НовыйПоярдок = ПорядокРегламентныхОпераций.Добавить();
		НовыйПоярдок.порядок = Порядок;
		НовыйПоярдок.ВидОперации = ВидРегОперации;
		Порядок = Порядок + 1;
	КонецЦикла;
	ЗапросПоРеглОперациям.УстановитьПараметр("ПорядокРегламентныхОпераций",ПорядокРегламентныхОпераций);
	
	ТекстЗапросаПоРеглОперациям =
	"ВЫБРАТЬ
	|	ВТ.Порядок,
	|	ВТ.ВидОперации
	|ПОМЕСТИТЬ ПорядокРегламентныхОпераций
	|ИЗ
	|	&ПорядокРегламентныхОпераций КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация,
	|	Док.Дата КАК Дата,
	|	Док.ВидОперации,
	|	Док.Представление КАК Представление
	|ИЗ
	|	Документ.РегламентнаяОперация КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокРегламентныхОпераций КАК ПорядокРегламентныхОпераций
	|		ПО Док.ВидОперации = ПорядокРегламентныхОпераций.ВидОперации
	|ГДЕ
	|	Док.Дата >= &ДатаНач
	|	И (НЕ Док.ПометкаУдаления)
	|	И Док.Состояние <> ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.НеВыполнено)
	|	И Док.Состояние <> ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.Пропущено)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	ПорядокРегламентныхОпераций.Порядок";
	
	Если Организация <> Неопределено Тогда
		Если ТипЗнч(Организация) = Тип("Массив") Тогда
			ТекстЗапросаПоРеглОперациям = СтрЗаменить(
				ТекстЗапросаПоРеглОперациям, "И (НЕ Док.ПометкаУдаления)", "И Док.Организация В (&Организация) И (НЕ Док.ПометкаУдаления)");
		Иначе
			ТекстЗапросаПоРеглОперациям = СтрЗаменить(
				ТекстЗапросаПоРеглОперациям, "И (НЕ Док.ПометкаУдаления)", "И Док.Организация = (&Организация) И (НЕ Док.ПометкаУдаления)");
		КонецЕсли;
	КонецЕсли;
	
	Если ДатаКон <> Дата('00010101') Тогда
		ТекстЗапросаПоРеглОперациям = СтрЗаменить(
			ТекстЗапросаПоРеглОперациям, "Док.Дата >= &ДатаНач", "Док.Дата МЕЖДУ &ДатаНач И &ДатаКон");
	КонецЕсли;
	
	ЗапросПоРеглОперациям.Текст = ТекстЗапросаПоРеглОперациям;
	ВыборкаРеглОпераций = ЗапросПоРеглОперациям.Выполнить().Выбрать();
	ТаблицаРеглДокументов = ЗапросПоРеглОперациям.Выполнить().Выгрузить();
	ТаблицаРеглДокументов.Колонки.Добавить("Выполнена", Новый ОписаниеТипов("Булево"));
	ВсегоРеглОпераций= ВыборкаРеглОпераций.Количество();
	
	Если ВсегоРеглОпераций>0 Тогда
		Если ФормаПрогрессора <> Неопределено Тогда
			ФормаПрогрессора.Значение = 0;
			ФормаПрогрессора.МаксимальноеЗначение = ВсегоРеглОпераций;		
			ФормаПрогрессора.КомментарийОбработкиДанных  = "Отмена проведения регламентных операций";		
			ФормаПрогрессора.Открыть();
		КонецЕсли;	
		
		Пока ВыборкаРеглОпераций.Следующий() Цикл
			
			Если ФормаПрогрессора <> Неопределено Тогда
				ФормаПрогрессора.КомментарийЗначения = ВыборкаРеглОпераций.Представление;
				ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
			КонецЕсли;
			
			НачатьТранзакцию();
			
			ВыборкаРеглОпераций.Ссылка.ПолучитьОбъект().ОтменитьОперацию();
			
			ЗафиксироватьТранзакцию();
			
		КонецЦикла;
	КонецЕсли;

	Если ФормаПрогрессора <> Неопределено Тогда
		ФормаПрогрессора.Значение = 0;
		ФормаПрогрессора.МаксимальноеЗначение = ВсегоДокументов+ВсегоРеглОпераций;
		ФормаПрогрессора.КомментарийОбработкиДанных  = "Проведение документов";		
		ФормаПрогрессора.Открыть();
	КонецЕсли;		
	
	
	ИндексСтрокиНачалаДаты = Неопределено;
	ТекущаяДатаПроведения = Неопределено;
	ПроведениеПрервано = ложь;
	
	Для индекс = 0 ПО ВсегоДокументов - 1 Цикл
		СтрокаДокумента = ТаблицаДокументов[индекс];
		Если ФормаПрогрессора <> Неопределено Тогда
			ФормаПрогрессора.КомментарийЗначения = СтрокаДокумента.Представление;
			ФормаПрогрессора.Значение = ФормаПрогрессора.Значение + 1;
		КонецЕсли;
		
		Если СтрокаДокумента.РеглДокумент ИЛИ СтрокаДокумента.СвязанныйДокумент Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = СтрокаДокумента.Ссылка.ПолучитьОбъект();
		Если ТекущаяДатаПроведения<> неопределено и (НачалоМесяца(ТекущаяДатаПроведения) <> НачалоМесяца(ДокументОбъект.Дата)) Тогда
			ВозниклаОшибка = ложь;
			ПровестиРегламентныеДокументыЗаМесяцПоНДС(ТаблицаДокументов,НачалоМесяца(ТекущаяДатаПроведения),ФормаПрогрессора,СдвигатьГраницуАктуальности,ЗаписыватьОшибкиВЖурналРегистрации,ИндексСтрокиНачалаДаты,ВозниклаОшибка);
			ПровестиРегламентныеДокументыЗаМесяц(ТаблицаРеглДокументов,НачалоМесяца(ТекущаяДатаПроведения),ФормаПрогрессора,ВозниклаОшибка);
			Если ВозниклаОшибка Тогда
				ПроведениеПрервано = истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущаяДатаПроведения <> ДокументОбъект.Дата Тогда
			ИндексСтрокиНачалаДаты = индекс;
			ТекущаяДатаПроведения = ДокументОбъект.Дата;
		КонецЕсли;
		
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			Если СдвигатьГраницуАктуальности Тогда
								
				Если СтрокаДокумента.БылаОшибка Тогда
					// для документа уже была ошибка проведения, продолжение не возможно
					ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(), , "Ошибка проведения!");
					Если ОстанавливатьсяПоОшибке Тогда
						ПроведениеПрервано = истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
				СдвигГраницыАктуальностиПоРазделам(СтрокаДокумента.ИмяДокумента, ДокументОбъект, ЗаписыватьОшибкиВЖурналРегистрации);
				СтрокаДокумента.БылаОшибка = Истина;
				индекс = ИндексСтрокиНачалаДаты;
				
			Иначе
				
				ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не проведен!" + Символы.ПС + "По причине: " + ОписаниеОшибки(), , "Ошибка проведения!");
				Если ОстанавливатьсяПоОшибке Тогда
					ПроведениеПрервано = истина;
					Прервать;
				КонецЕсли;				
			КонецЕсли;
		КонецПопытки;
		
	КонецЦикла;
	
	Если Не	ПроведениеПрервано Тогда
		ПровестиРегламентныеДокументыЗаМесяцПоНДС(ТаблицаДокументов,?(ДатаКон <> Дата('00010101'),НачалоМесяца(ДатаКон),Дата('30010101')),ФормаПрогрессора,СдвигатьГраницуАктуальности,ЗаписыватьОшибкиВЖурналРегистрации,ИндексСтрокиНачалаДаты);
		ПровестиРегламентныеДокументыЗаМесяц(ТаблицаРеглДокументов,?(ДатаКон <> Дата('00010101'),НачалоМесяца(ДатаКон),Дата('30010101')),ФормаПрогрессора);
	КонецЕсли;

	Если ФормаПрогрессора <> Неопределено Тогда
		ФормаПрогрессора.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура СдвигГраницыАктуальностиПоРазделам(ИмяДокумента, ДокументОбъект, ЗаписыватьКомментарийВЖурналРегистрации = Ложь)
	
	МетаданныеОбъекта = мКэшОбработки.МетаданныеОбъектов[ИмяДокумента];
	Если МетаданныеОбъекта = Неопределено Тогда
		МетаданныеОбъекта = ДокументОбъект.Метаданные();
		мКэшОбработки.МетаданныеОбъектов[ИмяДокумента] = МетаданныеОбъекта;
	КонецЕсли;
	
	Если МетаданныеОбъекта.Реквизиты.Найти("Организация") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатыПоРазделам = мКэшОбработки.АктуальностьРазделовПоОрганизации[ДокументОбъект.Организация];
	Если ДатыПоРазделам = Неопределено Тогда
		ДатыПоРазделам = ПолучитьДатыАктуальностиПоОрганизации(ДокументОбъект.Организация);//РегистрыСведений.ДатаАктуальностиУчета.Получить(Новый Структура("Организация", ДокументОбъект.Организация));
		мКэшОбработки.АктуальностьРазделовПоОрганизации[ДокументОбъект.Организация] = ДатыПоРазделам;		
	КонецЕсли;
	
	НужнаЗапись = Ложь;
	Для Каждого КлючИЗначение ИЗ ДатыПоРазделам Цикл
		Если КлючИЗначение.Значение > НачалоДня(НачалоДня(ДокументОбъект.Дата) - 1) Тогда
			ДатыПоРазделам[КлючИЗначение.Ключ] = НачалоДня(НачалоДня(ДокументОбъект.Дата) - 1);
			НужнаЗапись = Истина;
		КонецЕсли;		
	КонецЦикла;	
	
	Если НужнаЗапись Тогда
		Запись = РегистрыСведений.ДатаАктуальностиУчета.СоздатьМенеджерЗаписи();
		Запись.Организация = ДокументОбъект.Организация;
		Для Каждого КлючИЗначение ИЗ ДатыПоРазделам Цикл
			Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЦикла;
		Запись.Записать();
		
		ТекстКомментария = "Дата актуальности учета для организации """ + ДокументОбъект.Организация + """ установлена на " + НачалоДня(НачалоДня(ДокументОбъект.Дата) - 1) + " из-за ошибок при проведении документа " + ДокументОбъект;
		Если ЗаписыватьКомментарийВЖурналРегистрации Тогда			
			ЗаписьЖурналаРегистрации("Регламентное восстановление даты актуальности", УровеньЖурналаРегистрации.Предупреждение, Метаданные.РегламентныеЗадания.УстановкаДатыАктуальностиУчета, , ТекстКомментария);
		Иначе
			Сообщить(ТекстКомментария);
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

Функция ПолучитьДатыАктуальностиПоОрганизации(Организация)
	
	Результат = Новый Структура;
	Для Каждого РазделУчета Из Метаданные.РегистрыСведений.ДатаАктуальностиУчета.Ресурсы Цикл
		Результат.Вставить(РазделУчета.Имя, '00010101');
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатаАктуальностиУчета.ОценкаМПЗ,
	|	ДатаАктуальностиУчета.РасчетыСКонтрагентами,
	|	ДатаАктуальностиУчета.НДС,
	|	ДатаАктуальностиУчета.НУ
	|ИЗ
	|	РегистрСведений.ДатаАктуальностиУчета КАК ДатаАктуальностиУчета
	|ГДЕ
	|	ДатаАктуальностиУчета.Организация В (&Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА ДатаАктуальностиУчета.Организация = &Организация
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

мКэшОбработки = Новый Структура;
мКэшОбработки.Вставить("МетаданныеОбъектов", Новый Соответствие);
мКэшОбработки.Вставить("АктуальностьРазделовПоОрганизации", Новый Соответствие);
